# 运算符

# 算术运算符 + - * / % ** //

# /
# 在一些编程语言中 /整数0 会报错,而 /浮点数0.0 会得到一个无穷大, 在python中两个都会报错
# 在python中 整数/整数 如果除不尽会得到小数,而不会像C/C++、Java那样截断保留整数部分

print(4**0.5)

# // 地板除法 取整除法,若为负数则取较小的值
print(4//3)
print(-7//2)
print(4%3)

# 关系运算符 >< >= =< == !=
a = 10
b = 20
print(a>b)
print(a==b)
print(a<=b)

# 字符串的比较依照字典序
# 而在python中可以用== != 来比较字符串
print('hello'=='hello')

# 因浮点数在内存中存储存在误差,所以在比较浮点数时可能存在计算上的错误
print(0.1)
print(0.2)
print(0.1+0.2)
print(0.3)
print(0.3==0.1+0.2)
# 正确比较浮点数的方式是做差值,看差值是否小于预期的误差范围
a = 0.1+0.2
b = 0.3
print(-0.000001<(a-b)<0.000001) #在python中允许连续比较

# 逻辑操作符 and or not(not相当与C里的!)
# 和C++/Java一样,逻辑运算符里存在短路求值

# 赋值运算符 =
# a = b = 20 # 链式赋值
a,b = 10,20 #多元赋值 将10赋值给a,20赋值给b
tmp = a
a = b
b =tmp
a,b = b,a
print('a =',a,'b =',b)
# 复合赋值运算 += -= /= %= //= **= 需作用于已定义的变量
# python 中不支持++ --这样的自增与自减